{
    "grammar":[
        {
            "en":"Present Simple",
            "he":"הווה פשוט",
            "use":"נשתמש בזמן זה כדי לתאר פעולות שאנו עושים בדרך כלל או כדי לתאר הרגלים.",
            "shape":"לגופים ברבים (plurals) לא נוסיף דבר לפועל והוא יישאר כפי שהוא.\nלגופים ביחיד (רק ל- he,she,it) נוסיף לפועל s,es,ies לפי הכללים הבאים:\n* לפועל רגיל, שאין בו שום דבר מיוחד נוסיף s.\n* לפועל שמסתיים באות שורקת (s,z,x,ch,sh,o) נוסיף es.\n* לפועל שמסתיים ב-y ולפניו אות ניקוד, נוסיף רק s.\n* לפועל שמסתיים ב-y ולפניו אות רגילה נשמיט את ה-y ונוסיף ies.",
            "negative":"נוסיף don't  לרבים ו – doesn't  ליחיד. הפועל בשני המקרים לא ישתנה ולא נוסיף לו דבר."
        },
        {
            "en":"Present Progressive",
            "he":"הווה ממושך",
            "use":"נשתמש בזמן זה כדי לתאר פעולות שאנו עושים ברגע זה.",
            "shape":"לכל הגופים, יחיד ורבים, נוסיף תמיד את הפועל (am,is,are) :be ולפועל נוסיף ing לפי הכללים הבאים:\n* לפועל רגיל, שאין בו שום דבר מיוחד נוסיף ing.\n* לפועל שמסתיים באות e נשמיט את ה-e ונוסיף ing.\n* לפועל שמסתיים ב-ie נשמיט את ה-ie ונוסיף y+ing. יש רק שלושה פעלים כאלה באנגלית:   lie->lying   ;   die->dying     ;    tie->tying.\n* לפועל שמסתיים ב-c.v.c (אות רגילה - אות ניקוד - אות רגילה) ויש עליה דגש, נכפיל את האות האחרונה ונוסיף ing לא נכפיל את האותיות x,y,w גם אם הן עונות על הכללים האלה.",
            "negative":"נוסיף not  לאחר ה-be  לכל הגופים. ה-ing יישמר בשלילה ובחיוב."
        },
        {
            "en":"Past Simple",
            "he":"עבר פשוט",
            "use":"נשתמש בזמן זה כדי לתאר פעולות שהתרחשו והסתיימו בעבר.",
            "shape":"לכל הגופים נוסיף לפועל d, ed, ied לפי הכללים הבאים:\n* לפועל רגיל, שאין בו שום דבר מיוחד נוסיף ed.\n* לפועל שמסתיים ב-e נוסיף רק d.\n* לפועל שמסתיים ב-y ולפניו אות ניקוד (a,e,o,u,i) נוסיף רק ed.\n* לפועל שמסתיים ב-y ולפניו אות רגילה (עיצור) נשמיט את ה-y ונוסיף ied.\n* לפועל שמסתיים ב-c.v.c (אות רגילה - אות ניקוד - אות רגילה) ויש עליה דגש, נכפיל את האות האחרונה ונוסיף ed, לא נכפיל את האותיות x,y,w גם אם הן עונות על הכללים האלה.",
            "negative":"נוסיף didn't  לכל הגופים. הפועל לא ישתנה ולא נוסיף לו דבר."
        },
        {
            "en":"Past Progressive",
            "he":"עבר ממושך",
            "use":"נשתמש בזמן זה כדי:\n1. לתאר פעולה ארוכה בעבר.\n2. לתאר שתי פעולות (או יותר) שמתרחשות באותו הזמן בעבר.\n3. לתאר פעולה קצרה ש'מפריעה' לפעולה ארוכה בעבר.",
            "shape":"לכל הגופים, יחיד ורבים, נוסיף תמיד את הפועל be (was - (לגופים I,he,she,it), were - (לגופים you,we,they)) ולפועל נוסיף ing לפי הכללים הבאים:\n* לפועל רגיל, שאין בו שום דבר מיוחד נוסיף ing.\n* לפועל שמסתיים באות e נשמיט את ה-e ונוסיף ing.\n* לפועל שמסתיים ב-ie נשמיט את ה-ie ונוסיף y+ing. יש רק שלושה פעלים כאלה באנגלית:   lie->lying   ;   die->dying     ;    tie->tying\n* לפועל שמסתיים ב-c.v.c (אות רגילה - אות ניקוד - אות רגילה) ויש עליה דגש, נכפיל את האות האחרונה ונוסיף ing, לא נכפיל את האותיות x,y,w גם אם הן עונות על הכללים האלה.",
            "negative":"נוסיף not  לאחר ה-be  לכל הגופים. ה-ing יישמר בשלילה ובחיוב.."
        },
        {
            "en":"Future Simple",
            "he":"עתיד פשוט",
            "use":"נשתמש בזמן זה כדי לתאר פעולה שתתרחש בעתיד.",
            "shape":"לכל הגופים, יחיד ורבים, נוסיף תמיד will  והפועל יישאר ללא שינוי.",
            "negative":"נוסיף not  לאחר will  לכל הגופים."
        },
        {
            "en":"Present Perfect Simple",
            "he":"הווה מושלם פשוט",
            "use":"נשתמש בזמן זה כדי לתאר את הפעולות הבאות:\n1. פעולה שהתרחשה בעבר ואנחנו לא יודעים מתי.\n2. פעולה שהתחילה בעבר ומסתיימת ברגע הדיבור.\n3. פעולה שהתחילה בעבר ועדיין נמשכת.",
            "shape":"לכל הגופים נוסיף have/has (has - (לגופים I,he,she,it), have - (לגופים you,we,they)) ופועל יוצא דופן בצורתו השלישית (v3).\nפעלים בצורה השלישית מתחלקים לשניים:\n1. פעלים יוצאי דופן.\n2. פעלים רגילים, להם נוסיף d/ed/ied  לפי הכללים של ה – Past Simple.",
            "negative":"נוסיף not  לאחר ה- have/has."
        },
        {
            "en":"Present Perfect Progressive",
            "he":"הווה פרוגרסיבי מושלם",
            "use":"נשתמש בזמן זה כדי לתאר פעולה ממושכת שהתחילה בעבר ובדיוק הסתיימה או שעדיין נמשכת.",
            "shape":"לכל הגופים נוסיף have/has (has - (לגופים I,he,she,it), have - (לגופים you,we,they)) , ing+ v1 , been לפי כללי הוספת ing של Present Progressive.",
            "negative":"נוסיף not  לאחר ה- have/has. כל השאר לא ישתנה."
        },
        {
            "en":"Past Perfect Simple",
            "he":"עבר מושלם פשוט",
            "use":"נשתמש בזמן זה כדי לתאר פעולה שהתרחשה בעבר לפני פעולה אחרת בעבר. הפעולה הקדומה יותר תהיה ב- had+v3 <-- PAST PERFECT  . הפעולה שהתרחשה לאחר מכן תהיה ב-Past Simple.",
            "shape":"1. במשפט חייבות להיות שתי פעולות, כאשר אחת קודמת לשנייה. אם אין שתי פעולות, לא נשתמש בזמן זה!\n2. אם יש לנו במשפט before/after, אין צורך להשתמש בזמן של PAST PERFECT כיוון שאנו יודעים איזו פעולה קדמה לשנייה.\nבמצב כזה אפשר להשתמש רק ב- PAST SIMPLE. יחד עם זאת, שימוש ב-PAST PERFECT לא ייחשב כטעות והוא אפשרי בהחלט.",
            "negative":"נוסיף not  לאחר ה- had."
        }
    ]
}